Revit 2026 API

# NumberingFailures Properties

---

The BuiltInFailuresNumberingFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InputOutOfValidRangeError | The input value is out of the allowed range. |
|  | MoreThenOneElementWasChanged | The operation lead to the renumbering of more then one element. |
|  | NumberAlreadyInUseError | The new number is already in use. |
|  | SampleNumberingError | Replace this with the first real one |

#### Reference

BuiltInFailuresNumberingFailures Class

Autodesk.Revit.DB Namespace